We also tried to add

```hcl
username_configuration {
  case_sensitive = true
}
```

To the user pool. While it fixes the issue in ca-central-1, it will cause user pools in other regions to be recreated with

```
+ username_configuration {
  + case_sensitive = true # forces replacement
}
```

Here is a a configuration to reproduce the issue.

```hcl
resource "aws_cognito_user_pool" "pool_ca" {
    provider = aws.ca
    name = "mypool"
}

resource "aws_cognito_user_pool" "pool_us" {
    provider = aws.us
    name = "mypool"
}

provider "aws" {
    alias  = "ca"
    region = "ca-central-1"
}

provider "aws" {
    alias  = "us"
    region = "us-east-1"
}
```

```bash
terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cognito_user_pool.pool_ca will be created
  + resource "aws_cognito_user_pool" "pool_ca" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "mypool"
      + sms_verification_message   = (known after apply)
      + tags_all                   = (known after apply)
    }

  # aws_cognito_user_pool.pool_us will be created
  + resource "aws_cognito_user_pool" "pool_us" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "mypool"
      + sms_verification_message   = (known after apply)
      + tags_all                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_cognito_user_pool.pool_ca: Creating...
aws_cognito_user_pool.pool_us: Creating...
aws_cognito_user_pool.pool_ca: Creation complete after 1s [id=ca-central-1_xxxxxxxxx]
aws_cognito_user_pool.pool_us: Creation complete after 1s [id=us-east-1_xxxxxxxxx]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.


terraform plan
aws_cognito_user_pool.pool_ca: Refreshing state... [id=ca-central-1_xxxxxxxxx]
aws_cognito_user_pool.pool_us: Refreshing state... [id=us-east-1_xxxxxxxxx]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cognito_user_pool.pool_ca must be replaced
-/+ resource "aws_cognito_user_pool" "pool_ca" {
      ~ arn                        = "arn:aws:cognito-idp:ca-central-1:123456789012:userpool/ca-central-1_xxxxxxxxx" -> (known after apply)
      # [...]

      - username_configuration {
          - case_sensitive = true -> null # forces replacement
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

Adding 

```hcl
username_configuration {
  case_sensitive = true
}
```

To both pools

```bash
terraform plan
aws_cognito_user_pool.pool_ca: Refreshing state... [id=ca-central-1_xxxxxxxxx]
aws_cognito_user_pool.pool_us: Refreshing state... [id=us-east-1_xxxxxxxxx]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cognito_user_pool.pool_us must be replaced
-/+ resource "aws_cognito_user_pool" "pool_us" {
      ~ arn                        = "arn:aws:cognito-idp:us-east-1:123456789012:userpool/us-east-1_xxxxxxxxx" -> (known after apply)
      # [...]

      + username_configuration {
          + case_sensitive = true # forces replacement
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

